{
  "nodes": [
    {
      "id": "node_1766256023773",
      "data": {
        "json": "{\n  \"person\": {\n    \"firstName\": \"Gino\",\n    \"companyName\": \"American Recruiters\",\n    \"contact_title\": \"Founder and CEO\"\n  },\n  \"area_operations\": \"Headquartered in Coral Springs/Fort Lauderdale, Florida; operates nationally across the United States\",\n  \"base_contribution\": \"We will build and operate a dual-track Client Acquisition Operation that secures conversations with Hiring Managers in Healthcare/Foodservice for your recruiting arm, and prospective Franchisees seeking business opportunities nationally.\",\n  \"expanded\": \"We deploy a complete outbound infrastructure covering two distinct motions. For the recruiting track, we source HR Directors and VPs in Healthcare and Foodservice, enriching contacts for hiring intent signals (e.g., open roles). For the franchise track, we identify entrepreneurs and business owners seeking new ventures. The system handles end-to-end execution: precise list building, relevance-based enrichment, 1:1 personalized messaging, and inbox management to deliver qualified conversations directly to your team.\",\n  \"icp_targeting_statement\": {\n    \"motion_1_recruiting_clients\": \"HR Directors, VPs of Talent, and Hiring Managers in Hospitals, Nursing Homes, and Commercial Foodservice Equipment manufacturers across the US.\",\n    \"motion_2_franchise_sales\": \"Entrepreneurs, Small Business Owners, and Senior Executives in transition looking for business ownership opportunities.\"\n  },\n  \"angles\": {\n    \"identity_angle\": {\n      \"angle_id\": \"ang_identity_legacy_trust\",\n      \"angle_type\": \"identity\",\n      \"why_now_thesis\": \"Your 40-year legacy and Forbes recognition are underutilized assets that can significantly de-risk the investment decision for prospective franchisees in a volatile economic climate.\",\n      \"supporting_signals\": [\"sig_003\", \"sig_001\"],\n      \"situation_facts\": [\n        \"American Recruiters has operated since 1982 and holds Forbes recognition as a top recruiting firm.\",\n        \"The franchise offering is positioned as a stable, home-based investment with a $49,500 entry fee.\"\n      ],\n      \"implication_outcomes\": [\n        \"Leveraging brand longevity reduces skepticism for high-net-worth individuals evaluating the franchise opportunity.\",\n        \"Positions the franchise not just as a 'gig' but as a proven, legacy-backed asset.\"\n      ],\n      \"orbit_application\": \"Get in front of senior executives in transition and entrepreneurs to achieve higher trust conversion by leading with the '40-year proven brand' narrative in direct outreach.\",\n      \"persona_fit_note\": \"Aligns with Gino's pride in the 40-year brand and his focus on selling the business model rather than tactical recruiting.\",\n      \"scores\": {\n        \"implication_magnitude\": 7,\n        \"orbit_fit\": 8,\n        \"persona_fit\": 9,\n        \"novelty\": 5,\n        \"confidence\": 9\n      },\n      \"evidence_pack\": [\n        {\n          \"url\": \"https://www.americanrecruiters.com/franchise-now/\",\n          \"snippet\": \"Exceptional Brand Resilience... American Recruiters is regularly recognized as one of the best professional recruiting firms in the United States by Forbes Magazine... since 1982.\"\n        },\n        {\n          \"url\": \"https://www.americanrecruiters.com/franchise-now/\",\n          \"snippet\": \"Initial Fees and Royalties... Our initial franchise fee is $49,500.\"\n        }\n      ]\n    },\n    \"star_angle\": {\n      \"angle_id\": \"ang_threat_database_velocity\",\n      \"angle_type\": \"threat\",\n      \"why_now_thesis\": \"The 'instant clientbase advantage' promised to new franchisees creates an operational imperative to continuously flood the shared database with fresh, active job orders to prevent value-prop decay.\",\n      \"supporting_signals\": [\"sig_002\", \"sig_005\", \"sig_001\"],\n      \"situation_facts\": [\n        \"Franchise sales materials promise a 'shared database' that allows new owners to access client opportunities on day one.\",\n        \"There is a chronic talent shortage in healthcare, creating high demand for recruiting services.\",\n        \"Franchisees pay royalties (5-8%) based on their sales volume.\"\n      ],\n      \"implication_outcomes\": [\n        \"If the shared database lacks fresh, high-intent job orders, the core franchise value proposition weakens, risking franchisee churn.\",\n        \"A centralized surplus of job orders directly increases franchisee success rates and corporate royalty revenue.\"\n      ],\n      \"orbit_application\": \"Get in front of Hiring Managers in Healthcare and Foodservice to achieve a surplus of open job orders that validates the shared database promise for every new franchisee.\",\n      \"persona_fit_note\": \"Addresses the CEO's need to ensure the franchise product (the system) delivers on its promise to investors.\",\n      \"scores\": {\n        \"implication_magnitude\": 9,\n        \"orbit_fit\": 9,\n        \"persona_fit\": 8,\n        \"novelty\": 8,\n        \"confidence\": 9\n      },\n      \"evidence_pack\": [\n        {\n          \"url\": \"https://www.americanrecruiters.com/franchise-now/\",\n          \"snippet\": \"Instant Clientbase Advantage... shared database, connecting recruiters across locations to seamlessly share candidates and opportunities, on day one.\"\n        },\n        {\n          \"url\": \"https://dimensionalsearch.com/blog/ds-insights/best-recruiting-franchise-opportunities/\",\n          \"snippet\": \"Market Resilience: The chronic talent shortage across industries creates consistent demand for recruitment services...\"\n        },\n        {\n          \"url\": \"https://www.americanrecruiters.com/franchise-now/\",\n          \"snippet\": \"Franchisees also pay a Monthly Royalty which is based on their annual sales volume... 8% $1 – $1,000,000...\"\n        }\n      ]\n    },\n    \"secondary_angle\": {\n      \"angle_id\": \"ang_opp_market_gap_arbitrage\",\n      \"angle_type\": \"opportunity\",\n      \"why_now_thesis\": \"The sub-$50k investment threshold creates a specific arbitrage opportunity to capture entrepreneurs priced out of larger staffing franchises who are seeking recession-resistant exposure.\",\n      \"supporting_signals\": [\"sig_001\", \"sig_006\", \"sig_005\"],\n      \"situation_facts\": [\n        \"American Recruiters' initial franchise fee is $49,500, positioned as a low-investment model.\",\n        \"Competitors like Spherion often require higher investment ranges and different operational footprints.\",\n        \"Healthcare recruiting is viewed as a recession-resistant sector due to talent shortages.\"\n      ],\n      \"implication_outcomes\": [\n        \"Allows American Recruiters to aggressively target a specific 'accessible entrepreneurship' demographic that competitors miss.\",\n        \"Accelerates unit growth by removing the high-capital barrier to entry.\"\n      ],\n      \"orbit_application\": \"Get in front of entrepreneurs and small business owners to achieve franchise unit growth by pitching the specific 'low-barrier, high-demand' healthcare recruiting model.\",\n      \"persona_fit_note\": \"Directly supports the CEO's primary goal of selling franchise units and expanding the network.\",\n      \"scores\": {\n        \"implication_magnitude\": 8,\n        \"orbit_fit\": 8,\n        \"persona_fit\": 9,\n        \"novelty\": 7,\n        \"confidence\": 8\n      },\n      \"evidence_pack\": [\n        {\n          \"url\": \"https://www.americanrecruiters.com/franchise-now/\",\n          \"snippet\": \"Initial Fees and Royalties... Our initial franchise fee is $49,500.\"\n        },\n        {\n          \"url\": \"https://www.spherion.com/franchising/\",\n          \"snippet\": \"Investment Range and royalty structures differ across competitors.\"\n        },\n        {\n          \"url\": \"https://dimensionalsearch.com/blog/ds-insights/best-recruiting-franchise-opportunities/\",\n          \"snippet\": \"Market Resilience: The chronic talent shortage... making recruiting opportunities relatively recession-resistant.\"\n        }\n      ]\n    }\n  },\n  \"angle_checker\": {\n    \"selected_mode\": \"ANGLE\",\n    \"selected_angle_key\": \"star_angle\",\n    \"selected_angle_id\": \"ang_threat_database_velocity\",\n    \"identity_available\": true,\n    \"identity_angle_id\": \"ang_identity_legacy_trust\",\n    \"final_reason\": \"The Star Angle (Database Velocity) is selected because it presents a critical operational threat (value-prop decay) with high magnitude and directly aligns the AOS service with supporting franchisee success.\"\n  },\n  \"person_understanding\": {\n    \"professional_archetype\": \"Legacy Franchise Architect\",\n    \"core_day_to_day_operation\": \"Focuses on high-level franchise expansion strategy and selling the business model to potential franchise owners. Delegates daily recruiting operations to a team of 90 employees.\",\n    \"motivation_statement\": \"Driven by the legacy of a 40-year brand and the scalability of the franchise model rather than individual placement fees.\",\n    \"success_metric\": \"Franchise Units Sold & Brand Longevity\",\n    \"risk_profile\": \"Calculated / Strategic\"\n  },\n  \"base_angleCollection\": {\n    \"angle_id\": \"base_001\",\n    \"angle_type\": \"internal_pain\",\n    \"why_now_thesis\": \"Scaling a dual-track business (franchise sales + recruiting placements) via manual human effort creates a growth ceiling defined by headcount costs rather than market demand.\",\n    \"supporting_signals\": [\"sig_001\", \"sig_007\", \"sig_004\"],\n    \"situation_facts\": [\n      \"You operate a complex dual-funnel model: selling franchise licenses to entrepreneurs while simultaneously needing to secure job orders from healthcare and foodservice clients.\",\n      \"With ~90 employees, scaling these two distinct motions traditionally requires hiring more internal recruiters or franchise sales reps, which is expensive and slow to ramp.\"\n    ],\n    \"implication_outcomes\": [],\n    \"orbit_application\": \"Deploy a systematic outbound infrastructure that autonomously targets prospective franchisees and healthcare hiring managers, delivering qualified conversations to your existing team without requiring new headcount.\",\n    \"persona_fit_note\": \"Aligned with the 'Legacy Franchise Architect' persona by focusing on operational leverage and scalable systems rather than tactical lead generation or candidate sourcing tools.\",\n    \"scores\": {\n      \"implication_magnitude\": 7,\n      \"orbit_fit\": 9,\n      \"persona_fit\": 8,\n      \"novelty\": 3,\n      \"confidence\": 8\n    },\n    \"evidence_pack\": [],\n    \"baseline_meta\": {\n      \"segment\": \"mid_big_company\",\n      \"selected_pain_points\": [\"mb_02\", \"mb_05\"],\n      \"baseline_bar\": 7\n    }\n  }\n}\n",
        "type": "JSON",
        "label": "New Processor",
        "inputs": [
          "input"
        ],
        "status": "success",
        "outputs": [
          "output"
        ],
        "outputData": "Here is an overview of the potential health benefits of drinking wine, balanced with the necessary scientific context and cautions.\n\n***\n\n# Uncorking the Truth: The Potential Health Benefits of Wine\n\nFor centuries, wine has been a staple of human culture, religion, and dining. From the \"French Paradox\" to the diets of the world’s longest-living populations, wine often occupies a complex space between a guilty pleasure and a health tonic.\n\nWhile alcohol is a toxin and excessive consumption is undeniably harmful, scientific research suggests that **moderate** consumption of wine—particularly red wine—may offer specific health benefits.\n\nHere is a look at the science behind the glass.\n\n### 1. Rich in Antioxidants\nThe primary health claim regarding wine centers on **polyphenols**, which are naturally occurring plant compounds that act as antioxidants.\n*   **The Science:** Antioxidants fight \"oxidative stress\" in the body, which is caused by free radicals. Oxidative stress is a key driver of aging, inflammation, and chronic diseases.\n*   **Red vs. White:** Because these polyphenols are found primarily in the skins of grapes, red wine (fermented with skins) contains significantly more antioxidants than white wine (fermented without skins).\n\n### 2. The \"Star\" Compound: Resveratrol\nAmong the antioxidants in wine, **resveratrol** gets the most attention. It acts as an anti-inflammatory agent and has been linked to several health benefits in laboratory studies.\n*   **Heart Health:** Resveratrol may help prevent damage to blood vessels, reduce low-density lipoprotein (LDL) cholesterol (the \"bad\" cholesterol), and prevent blood clots.\n*   **Longevity:** Some studies suggest resveratrol activates genes that ward off the diseases of aging, though human trials are still ongoing to determine exactly how much wine one would need to drink to see these effects.\n\n### 3. Cardiovascular Health\nThis is the most well-documented benefit. Moderate wine consumption is often linked to a lower risk of heart disease.\n*   **Cholesterol:** Moderate alcohol consumption can raise high-density lipoprotein (HDL) cholesterol—the \"good\" kind—by as much as 12%.\n*   **Blood Pressure:** While heavy drinking raises blood pressure, small amounts of red wine may help relax blood vessel walls, improving blood flow.\n\n### 4. Reduced Risk of Type 2 Diabetes\nResearch indicates that moderate alcohol intake might reduce the risk of developing Type 2 diabetes, particularly in women.\n*   **Insulin Sensitivity:** The ethanol in wine, combined with polyphenols, may improve the body's sensitivity to insulin, helping to regulate blood sugar levels more effectively.\n\n### 5. Gut Health\nEmerging science suggests that red wine may act as a prebiotic.\n*   **Microbiome Diversity:** A study from King’s College London found that red wine drinkers had a more diverse gut microbiome (a sign of gut health) compared to non-drinkers or those who drank other types of alcohol. This is likely due to the diverse polyphenols found in the grape skins.\n\n### 6. Cognitive Health\nWhile heavy drinking destroys brain cells, moderate consumption has been linked to a slower decline in cognitive ability.\n*   **The MIND Diet:** Wine is a component of the MIND diet (a hybrid of the Mediterranean and DASH diets), which is specifically designed to reduce the risk of Alzheimer’s and dementia. The anti-inflammatory properties of wine are believed to protect the brain's blood vessels.\n\n---\n\n### The Crucial Caveat: Moderation is Key\nIt is impossible to discuss the benefits of wine without discussing the risks. The line between \"healthy\" and \"harmful\" is thin. The benefits mentioned above **disappear and reverse** when consumption becomes heavy.\n\n**What is \"Moderate\" Drinking?**\nAccording to dietary guidelines:\n*   **Women:** Up to 1 drink per day.\n*   **Men:** Up to 2 drinks per day.\n\n*Note: One drink is defined as **5 ounces (148 ml)** of wine. Many modern wine glasses hold 10 to 12 ounces, leading people to inadvertently drink double the recommended amount.*\n\n### The Risks of Overconsumption\nDrinking more than the recommended amount increases the risk of:\n*   Liver disease (cirrhosis).\n*   Various cancers (breast, throat, and colon cancer risks rise with alcohol intake).\n*   Heart failure and high blood pressure.\n*   Addiction and dependency.\n*   Weight gain (wine is calorie-dense).\n\n### The Verdict\nShould you start drinking wine for your health? **No.**\n\nDoctors generally agree that if you do not currently drink alcohol, you should not start simply for the potential health benefits. You can get polyphenols and resveratrol from eating red grapes, blueberries, and peanuts without the risks associated with alcohol.\n\nHowever, if you **already** enjoy a glass of Pinot Noir with dinner, you can do so with the knowledge that, when kept in moderation, it may be contributing to your heart and gut health.\n\n***\n\n*Disclaimer: This information is for educational purposes and does not constitute medical advice. Always consult with a healthcare professional regarding your diet and alcohol consumption, especially if you have a family history of addiction or specific medical conditions.*"
      },
      "type": "custom",
      "width": 200,
      "height": 92,
      "dragging": false,
      "position": {
        "x": -433.5359467503764,
        "y": -190.8712826940584
      },
      "selected": false,
      "positionAbsolute": {
        "x": -433.5359467503764,
        "y": -190.8712826940584
      }
    },
    {
      "id": "node_1766324188323",
      "data": {
        "type": "LLM",
        "label": "crafter archytect",
        "inputs": [
          "input"
        ],
        "schema": "{\n  \"type\": \"object\",\n  \"properties\": {\n    \"architecture_mode\": {\n      \"type\": \"string\",\n      \"enum\": [\n        \"ANGLE\",\n        \"BASE_ONLY\"\n      ]\n    },\n    \"hook\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"intent_sentence\": {\n          \"type\": \"string\"\n        },\n        \"source\": {\n          \"type\": \"string\",\n          \"enum\": [\n            \"selected_angle\",\n            \"base_angle\"\n          ]\n        },\n        \"certainty_level\": {\n          \"type\": \"string\"\n        }\n      },\n      \"required\": [\n        \"intent_sentence\",\n        \"source\",\n        \"certainty_level\"\n      ]\n    },\n    \"situation\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"fact_sentence\": {\n          \"type\": \"string\"\n        },\n        \"signal_ids_used\": {\n          \"type\": \"array\",\n          \"items\": {\n            \"type\": \"string\"\n          }\n        }\n      },\n      \"required\": [\n        \"fact_sentence\",\n        \"signal_ids_used\"\n      ]\n    },\n    \"implication\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"cost_sentence\": {\n          \"type\": \"string\"\n        },\n        \"angle_type\": {\n          \"type\": \"string\",\n          \"enum\": [\n            \"THREAT\",\n            \"OPPORTUNITY\",\n            \"PAIN\"\n          ]\n        }\n      },\n      \"required\": [\n        \"cost_sentence\",\n        \"angle_type\"\n      ]\n    },\n    \"bridge\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"outcome_sentence\": {\n          \"type\": \"string\"\n        },\n        \"implied_requirement\": {\n          \"type\": \"string\"\n        }\n      },\n      \"required\": [\n        \"outcome_sentence\",\n        \"implied_requirement\"\n      ]\n    },\n    \"contribution\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"line_1\": {\n          \"type\": \"string\"\n        },\n        \"line_2\": {\n          \"type\": \"string\",\n          \"nullable\": true\n        },\n        \"line_3\": {\n          \"type\": \"string\",\n          \"nullable\": true\n        }\n      },\n      \"required\": [\n        \"line_1\",\n        \"line_2\",\n        \"line_3\"\n      ]\n    },\n    \"details\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"lead_sourcing\": {\n          \"type\": \"string\"\n        },\n        \"personalization\": {\n          \"type\": \"string\"\n        },\n        \"execution\": {\n          \"type\": \"string\"\n        },\n        \"dfy_statement\": {\n          \"type\": \"string\"\n        }\n      },\n      \"required\": [\n        \"lead_sourcing\",\n        \"personalization\",\n        \"execution\",\n        \"dfy_statement\"\n      ]\n    },\n    \"cta\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"sentence_1\": {\n          \"type\": \"string\"\n        },\n        \"sentence_2\": {\n          \"type\": \"string\"\n        },\n        \"sentence_3\": {\n          \"type\": \"string\"\n        },\n        \"sentence_4\": {\n          \"type\": \"string\"\n        }\n      },\n      \"required\": [\n        \"sentence_1\",\n        \"sentence_2\",\n        \"sentence_3\",\n        \"sentence_4\"\n      ]\n    },\n    \"compliance_checks\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"no_new_facts\": {\n          \"type\": \"boolean\"\n        },\n        \"inside_base_contribution\": {\n          \"type\": \"boolean\"\n        },\n        \"no_volume_overpromise\": {\n          \"type\": \"boolean\"\n        },\n        \"architecture_valid\": {\n          \"type\": \"boolean\"\n        }\n      },\n      \"required\": [\n        \"no_new_facts\",\n        \"inside_base_contribution\",\n        \"no_volume_overpromise\",\n        \"architecture_valid\"\n      ]\n    }\n  },\n  \"required\": [\n    \"architecture_mode\",\n    \"hook\",\n    \"situation\",\n    \"implication\",\n    \"bridge\",\n    \"contribution\",\n    \"details\",\n    \"cta\",\n    \"compliance_checks\"\n  ]\n}\n",
        "status": "running",
        "outputs": [
          "output"
        ],
        "variants": [],
        "outputData": "{\n  \"render_spec\": {\n    \"meta\": {\n      \"project\": \"AOS_Cold_Email_Gen\",\n      \"architecture\": \"DEEP_EMAIL_DNA_v6\",\n      \"lead_context\": {\n        \"id\": \"{{node_1766256023773.person.id}}\",\n        \"role\": \"{{node_1766256023773.person.contact_title}}\",\n        \"company\": \"{{node_1766256023773.person.companyName}}\",\n        \"region\": \"{{node_1766256023773.area_operations}}\"\n      },\n      \"tone_guidance\": \"Spoken, sharp, grounded. No fluff. No abstraction.\",\n      \"hedging_policy\": \"Check selected_angle.scores.confidence. If < 7, use cautious language (e.g., 'seems to be', 'suggests'). Do not use [Assumed] tags.\"\n    },\n    \"angle_selection_orders\": {\n      \"primary_directive\": \"Identify the Selected Angle using the 'angle_checker' decision. If decision.selected_mode is 'ANGLE', use the angle object from 'angles' matching 'selected_angle_key'. Otherwise, use 'base_angle'.\",\n      \"fallback_directive\": \"If no specific angle is selected, default to the Base Angle.\"\n    },\n    \"sections\": [\n      {\n        \"id\": \"hook\",\n        \"type\": \"opening_punch\",\n        \"instructions\": \"Write one short sentence (max 15 words) that stops attention. State the pain, threat, or dream identified in the Selected Angle's implication. Do NOT mention AOS, tools, or the solution. Must be a punch phrase derived from the implication.\",\n        \"source_data\": \"Selected Angle (Implication/Pain)\"\n      },\n      {\n        \"id\": \"situation\",\n        \"type\": \"grounding_signal\",\n        \"instructions\": \"State the concrete, observable fact (signal) that makes the hook true. Must be literal and specific (e.g., a specific event, job post, or market shift found in inputs). Do not interpret or summarize. Max 1 sentence.\",\n        \"source_data\": \"Selected Angle (Situation Facts)\"\n      },\n      {\n        \"id\": \"implication\",\n        \"type\": \"consequence\",\n        \"instructions\": \"Explain the cost of inaction. Why does the Situation matter to this specific Lead? Focus on loss, risk, or missed capture. Make it personal to their role. Do not propose a solution yet.\",\n        \"source_data\": \"Selected Angle (Implication Outcomes)\"\n      },\n      {\n        \"id\": \"bridge\",\n        \"type\": \"flip_to_outcome\",\n        \"instructions\": \"Flip the problem into a controllable outcome. Describe the end-state required to solve the implication (e.g., 'If you could...'). Do not explain 'how' or mention tools. Set up the requirement for the Contribution.\",\n        \"source_data\": \"Selected Angle (Orbit/Gap)\"\n      },\n      {\n        \"id\": \"contribution\",\n        \"type\": \"offer_promise\",\n        \"instructions\": \"Fill the mandatory DNA v6 template. Line 1: 'If this makes sense, we can get you as many appointments as you want with [ICP from Base Contribution/Human Context] (who are [Context from Situation]).' Line 2: OMIT (Pre-interest not allowed). Line 3: Include ONLY if region is defined ('And we can replicate this across [Region], at scale, automatically.').\",\n        \"source_data\": \"Base Contribution + Human Context + Region\",\n        \"constraints\": {\n          \"allow_pre_interest\": false,\n          \"volume_policy\": \"Use 'as many as you want'. Do not invent numbers.\"\n        }\n      },\n      {\n        \"id\": \"details\",\n        \"type\": \"capability_proof\",\n        \"instructions\": \"Use the mandatory DNA v6 bullets template: 'We can do this by: Sourcing [ICP] at scale', 'Writing deeply personalized and relevant emails...', 'Managing all outbound campaigns end-to-end'. Final sentence: 'We'll take care of the whole process — [Company Name] will just have to close all the new deals.'\",\n        \"source_data\": \"Base Contribution (Capabilities)\"\n      },\n      {\n        \"id\": \"cta\",\n        \"type\": \"soft_ask\",\n        \"instructions\": \"Use the mandatory DNA v6 CTA: 'If you like the idea, I’d love to show you more details over a quick 10-minute demo. There, I’ll prepare a sample of 50 leads, all with tailored messages. That way, you can see the quality of our results first. If you’re open to it, let me know when it’s the best time for the demo.'\",\n        \"source_data\": \"DNA v6 Template\"\n      }\n    ]\n  }\n}",
        "userPrompt": "Build the Render Spec (orders) for the downstream writer using the input JSON below.\nReturn ONLY valid JSON matching the exact output schema.\n\nLEAD\nlead_id: \nfirst_name: {{node_1766256023773.person.firstName}}\ncompany_name: {{node_1766256023773.person.companyName}}\ncontact_title: {{node_1766256023773.person.contact_title}}\nlanguage: english\nregion: {{node_1766256023773.area_operations}}\n\nMODULE OUTPUTS (raw JSON)\nBASE ANGLE (angle-like):\n{{node_1766256023773.base_angleCollection}}\n\nANGLE SYNTHESIZER (angle-like objects):\n{{node_1766256023773.angles}}\n\nANGLE CHECKER (decision):\n{{node_1766256023773.angle_checker}}\n\nBASE CONTRIBUTION (raw JSON):\n{{node_1766256023773.base_contribution}}\n\nHUMAN CONTEXT (raw JSON): \n{{node_1766256023773.person_understanding}}\n\nCONSTRAINTS (raw JSON):\n{\n \"constraints\": {\n    \"one_sentence_per_paragraph\": true,\n    \"no_invented_facts\": true,\n    \"no_competitor_invention\": true,\n    \"no_time_claims_unless_in_inputs\": true,\n    \"hook_max_words\": 15,\n    \"hook_target_words\": 10,\n    \"never_print_assumed_tags\": true,\n    \"uncertainty_language_policy\": \"ALLOW_HEDGING_IF_LOW_CERTAINTY\"\n  }\n\n\nPROMISE GUARDRAILS (raw JSON):\n{\n\"promise_guardrails\": {\n    \"volume_claim_policy\": \"Do not claim 'thousands per day' or any specific volume unless explicitly supported by inputs.\",\n    \"allowed_soft_claim\": \"as many as you want within your ICP’s available volume\",\n    \"pre_interest_claim_allowed\": false\n  }\n\n\nDNA v6 (architecture only):\nenabled: true\n\nINTERNAL SELECTION RULES (must follow strictly)\n1) Parse objects:\n- base_angle := \n- baseline_bar := \n- identity_angle := \n- star_angle := \n- secondary_angle := \n- decision := \n\n2) Select primary angle object:\n- If decision.selected_mode == \"ANGLE\":\n    selected_angle := object referenced by decision.selected_angle_key (star_angle or secondary_angle)\n  Else:\n    selected_angle := base_angle\n\n3) Identity angle usage:\n- identity_angle may be used ONLY as optional identity/tone framing guidance.\n- identity_angle must NEVER be used as the primary problem frame.\n\n4) Hedging policy:\n- hedging_required := true if selected_angle.scores.confidence < 7\n- If hedging_required, instruct cautious language in Hook/Situation/Implication/Bridge.\n- Never print “[Assumed]” tags downstream.\n\n5) Grounding policy (critical):\n- Situation section must be built ONLY from selected_angle.situation_facts (literal, concrete facts; max 2 facts).\n- Implication section must be built ONLY from selected_angle.implication_outcomes (max 1 outcome).\n- Hook must be derived from the implication (pain/dream punch), without adding new facts.\n- Bridge must describe the end-state implied by selected_angle.orbit_application, WITHOUT mentioning AOS/tools/how-to.\n\n6) Offer + Details + CTA (DNA v6 template enforcement):\n- Contribution must use DNA v6 offer template lines, filled.\n  - selected_angle context (situation/implication framing)\n- Details must use DNA v6 details template lines (no tool lists, no tactics, no invented volume claims).\n- CTA must use DNA v6 CTA template lines.\n\n7) Competitors and time claims:\n- Only mention competitors if explicitly present in selected_angle.situation_facts OR selected_angle.evidence_pack.\n- Only mention timeframes if explicitly present in selected_angle.situation_facts OR selected_angle.evidence_pack.\n\nNow produce the Render Spec JSON (orders) for Crafter Harmonizer using DNA v6 architecture only.\nReturn ONLY valid JSON matching the exact output schema.\n",
        "systemPrompt": "ROLE\nYou are AOS Crafter Architect (INSTRUCTIONS ONLY).\n\nGOAL\nGiven a selected Angle + Base Contribution + Human Context + constraints, output a Render Spec (orders) that tells a downstream writer (Crafter Harmonizer) exactly how to write each email section using DEEP EMAIL DNA v6 (ARCHITECTURE ONLY).\n\nABSOLUTE RULES\n1) OUTPUT ONLY JSON: Return only valid JSON that matches the exact output schema; no markdown, no commentary.\n2) INSTRUCTIONS ONLY: Do NOT output a finished email, and do NOT output full final section sentences.\n   You MAY output short tokens/phrases (ICP phrase, region scope, situation phrase) needed to fill templates.\n3) TRUTH: No invented facts. Use only what exists in inputs.\n4) COMPETITORS: Only mention competitors if explicitly in inputs; otherwise do not allow competitor mentions.\n5) TIME CLAIMS: Only allow time claims if explicitly in inputs.\n6) SIGNAL GROUNDING: Situation must be literal and concrete; forbid abstract summaries.\n7) UNCERTAINTY:\n   - Angle may include certainty and assumption_notes.\n   - Never print \"[Assumed]\" tags in downstream email.\n   - If certainty is LOW, set flags.hedging_required=true and instruct cautious language in Hook/Situation/Implication/Bridge.\n8) TEMPLATE ENFORCEMENT:\n   Contribution must use DNA v6 offer template lines.\n   Details must use DNA v6 details template lines.\n   CTA must use DNA v6 CTA template lines.\n   Pre-interest line is allowed ONLY if input says pre_interest_claim_allowed=true.\n\nDEEP EMAIL DNA v6 (ARCHITECTURE ONLY)\nHook → Situation → Implication → Bridge → Contribution → Details → CTA\n(Use the v6 rules as constraints; do not rewrite them.)\n{\nDEEP EMAIL DNA v6\n(ARCHITECTURE ONLY)\nPurpose\nGenerate a cold email that feels spoken, sharp, and grounded in reality.\nThe email must read like a single causal chain:\nHook → Situation → Implication → Bridge → Contribution → Details → CTA\nNo fluff.\n No abstraction.\n No invented facts.\nGlobal Rules\nTruth and Grounding\nNo invented facts.\n\nOnly use what exists in inputs (signals, angle, business/human context, base contribution).\n\nNo competitor invention. Competitor names only if explicitly provided.\n\nNo time claims unless provided.\n\nDo not add “in weeks/months” unless inputs contain that timeline.\n\nNo abstraction for signals.\n\nIf a signal exists, state it as a concrete event or fact.\n\nDo not compress into interpretations (e.g., “competitors are aggressive”).\n\nSection Definitions and Requirements\n1) HOOK\nDefinition\nThe opening punch sentence.\nJob\nStop attention immediately by stating the pain, threat, risk, or dream state.\nRules\nMust be one short sentence\n\nMust be pain-forward or dream-forward, not a summary\n\nMust connect to something AOS can solve later (logically)\n\nMust not pitch or mention AOS/tools\n\nOften ends with something like:\n “…if you don’t do something.”\n\n~10 words (maximum 15)\n\nRules for the Prompt Process\nMust use the angle implication and turn it into a punch phrase\n\nMust Avoid\nGeneric openers (“Hope you’re well”)\n\nAbstract phrasing (“The market is competitive”)\n\nSoftening language (“might,” “perhaps”), unless inputs are uncertain\n\n2) SITUATION (Signal / Event / Suceso)\nDefinition\nThe real-world fact that makes the hook true.\nJob\nGround the hook in reality so it feels factual, not speculative.\nRules\nMust be concrete and observable\n\nInternal web\n\nLinkedIn signal\n\nExternal web signal\n\nMust be stated literally, not interpreted\n\nComes immediately after the Hook\n\nRules for the Prompt Process\nMust use angle details content\n\nSynthesize to maximize the Implication\n\nMust Avoid\nVague claims (“they’re scaling fast”) without a specific signal\n\nInvented stats or adoption claims\n\n3) IMPLICATION\nDefinition\nThe consequence of the situation for the lead.\nJob\nMake the cost of inaction unavoidable and personal to their role.\nRules\nIf angle is Threat → implication must be loss / risk / erosion\n\nIf angle is Opportunity → implication must be missed capture / closing window\n\nIf angle is Pain Point → implication must be missed opportunities\n\nMust clearly show why inaction is costly\n\nMust not propose a solution yet\n\nMust Avoid\nBroad business philosophy\n\nLong-term, vague consequences\n\n4) BRIDGE\nDefinition\nThe flip from problem → controllable outcome.\nJob\nMake the resolution feel obvious and logical, without pitching.\nRules\nDescribes the end result of the solution, not the solution itself\n\nUses the applied contribution solution to generate the end-state\n\nMust imply resolution as an outcome, not a method\n\nMust not mention AOS, tools, or execution details\n\nMust connect naturally from the implication\n\nMust set up an implied requirement\n (e.g., “to get this outcome, they need X access/positioning”)\n\nOften starts with:\n “If you could…”\nMust Avoid\nHow-to explanations\n\nTactical steps\n\n5) CONTRIBUTION (Offer)\nDefinition\nThe Offer Phrase block: a short, spoken promise framed as “why this makes sense.”\nJob\nMake the reader think:\n “That is exactly what I need.”\n While staying inside the base contribution ceiling.\nMandatory Template Structure\nLine 1 (mandatory):\n If this makes sense, we can get you as many appointments as you want with (ICP – CONTEXT leads like X) (who are facing this situation → formatted),\nLine 2 (optional — only if supported by inputs):\n (All of them interested in your offer beforehand.)\nLine 3 (optional — only if region/scope is defined and feasible):\n (And we can replicate this across the entire operating region, at scale, automatically.)\nRules\nMust stay inside the base contribution ceiling\n\nMust clearly fulfill the Bridge’s implied outcome\n\nBridge suggests a specific outcome\n\nContribution must subsume that outcome\n\nNo guarantees of closing or winning specific clients\n\nMust not claim pre-interest unless explicitly supported\n\nMust Avoid\nNarrowing the base contribution beyond scope\n\nAdding extra promises\n\n6) DETAILS\nDefinition\nA short capability proof explaining why the Contribution is achievable and done-for-you, without revealing the playbook.\nJob\nReduce skepticism while keeping execution hidden.\nMandatory Template\nWe can do this by:\nSourcing (ICP) at scale\n\nWriting deeply personalized and relevant emails, designed to spark real interest\n\nManaging all outbound campaigns end-to-end\n\nWe'll take care of the whole process — (company name) will just have to close all the new deals.\nMandatory Content Requirements\nLead sourcing:\n\nDescribe what leads will be sourced\n\nMust align with base + applied contribution\n\nDeep personalization:\n\nEnriched\n\nVerified\n\nDeeply personalized\n\nOne-to-one tone\n\nEnd-to-end management:\n\nFully done-for-you execution\n\nFinal sentence must explicitly state DFY (done-for-you).\nMust Avoid\nTactical sequences or tool lists\n\nUnrealistic city-specific volumes\n\nRepeating competitor narratives across bullets\n\n7) CTA\nDefinition\nSoft invitation to the next step.\nJob\nMake booking feel easy and risk-free.\nMandatory Template\nIf you like the idea, I’d love to show you more details over a quick 10-minute demo.\nThere, I’ll prepare a sample of 50 leads, all with tailored messages.\nThat way, you can see the quality of our results first.\nIf you’re open to it, let me know when it’s the best time for the demo.\nRules\nShort demo (~10 minutes)\n\nRisk-free sample of 50 leads with personalized emails\n\nSoft ask for availability\n\nNo urgency or scarcity language\n\n\n}\n\nOUTPUT\nReturn the Render Spec JSON only.\n\n\n\nBuild the Render Spec (orders) for the downstream writer using the input JSON below.\nReturn ONLY valid JSON matching the exact output schema.\n",
        "activeVariantId": "master"
      },
      "type": "custom",
      "width": 200,
      "height": 92,
      "dragging": false,
      "position": {
        "x": -143.01643138129958,
        "y": -178.45935929647277
      },
      "selected": false,
      "positionAbsolute": {
        "x": -143.01643138129958,
        "y": -178.45935929647277
      }
    }
  ],
  "edges": [
    {
      "id": "e-node_1766256023773-node_1766324188323",
      "data": {
        "output": "Here is an overview of the potential health benefits of drinking wine, balanced with the necessary scientific context and cautions.\n\n***\n\n# Uncorking the Truth: The Potential Health Benefits of Wine\n\nFor centuries, wine has been a staple of human culture, religion, and dining. From the \"French Paradox\" to the diets of the world’s longest-living populations, wine often occupies a complex space between a guilty pleasure and a health tonic.\n\nWhile alcohol is a toxin and excessive consumption is undeniably harmful, scientific research suggests that **moderate** consumption of wine—particularly red wine—may offer specific health benefits.\n\nHere is a look at the science behind the glass.\n\n### 1. Rich in Antioxidants\nThe primary health claim regarding wine centers on **polyphenols**, which are naturally occurring plant compounds that act as antioxidants.\n*   **The Science:** Antioxidants fight \"oxidative stress\" in the body, which is caused by free radicals. Oxidative stress is a key driver of aging, inflammation, and chronic diseases.\n*   **Red vs. White:** Because these polyphenols are found primarily in the skins of grapes, red wine (fermented with skins) contains significantly more antioxidants than white wine (fermented without skins).\n\n### 2. The \"Star\" Compound: Resveratrol\nAmong the antioxidants in wine, **resveratrol** gets the most attention. It acts as an anti-inflammatory agent and has been linked to several health benefits in laboratory studies.\n*   **Heart Health:** Resveratrol may help prevent damage to blood vessels, reduce low-density lipoprotein (LDL) cholesterol (the \"bad\" cholesterol), and prevent blood clots.\n*   **Longevity:** Some studies suggest resveratrol activates genes that ward off the diseases of aging, though human trials are still ongoing to determine exactly how much wine one would need to drink to see these effects.\n\n### 3. Cardiovascular Health\nThis is the most well-documented benefit. Moderate wine consumption is often linked to a lower risk of heart disease.\n*   **Cholesterol:** Moderate alcohol consumption can raise high-density lipoprotein (HDL) cholesterol—the \"good\" kind—by as much as 12%.\n*   **Blood Pressure:** While heavy drinking raises blood pressure, small amounts of red wine may help relax blood vessel walls, improving blood flow.\n\n### 4. Reduced Risk of Type 2 Diabetes\nResearch indicates that moderate alcohol intake might reduce the risk of developing Type 2 diabetes, particularly in women.\n*   **Insulin Sensitivity:** The ethanol in wine, combined with polyphenols, may improve the body's sensitivity to insulin, helping to regulate blood sugar levels more effectively.\n\n### 5. Gut Health\nEmerging science suggests that red wine may act as a prebiotic.\n*   **Microbiome Diversity:** A study from King’s College London found that red wine drinkers had a more diverse gut microbiome (a sign of gut health) compared to non-drinkers or those who drank other types of alcohol. This is likely due to the diverse polyphenols found in the grape skins.\n\n### 6. Cognitive Health\nWhile heavy drinking destroys brain cells, moderate consumption has been linked to a slower decline in cognitive ability.\n*   **The MIND Diet:** Wine is a component of the MIND diet (a hybrid of the Mediterranean and DASH diets), which is specifically designed to reduce the risk of Alzheimer’s and dementia. The anti-inflammatory properties of wine are believed to protect the brain's blood vessels.\n\n---\n\n### The Crucial Caveat: Moderation is Key\nIt is impossible to discuss the benefits of wine without discussing the risks. The line between \"healthy\" and \"harmful\" is thin. The benefits mentioned above **disappear and reverse** when consumption becomes heavy.\n\n**What is \"Moderate\" Drinking?**\nAccording to dietary guidelines:\n*   **Women:** Up to 1 drink per day.\n*   **Men:** Up to 2 drinks per day.\n\n*Note: One drink is defined as **5 ounces (148 ml)** of wine. Many modern wine glasses hold 10 to 12 ounces, leading people to inadvertently drink double the recommended amount.*\n\n### The Risks of Overconsumption\nDrinking more than the recommended amount increases the risk of:\n*   Liver disease (cirrhosis).\n*   Various cancers (breast, throat, and colon cancer risks rise with alcohol intake).\n*   Heart failure and high blood pressure.\n*   Addiction and dependency.\n*   Weight gain (wine is calorie-dense).\n\n### The Verdict\nShould you start drinking wine for your health? **No.**\n\nDoctors generally agree that if you do not currently drink alcohol, you should not start simply for the potential health benefits. You can get polyphenols and resveratrol from eating red grapes, blueberries, and peanuts without the risks associated with alcohol.\n\nHowever, if you **already** enjoy a glass of Pinot Noir with dinner, you can do so with the knowledge that, when kept in moderation, it may be contributing to your heart and gut health.\n\n***\n\n*Disclaimer: This information is for educational purposes and does not constitute medical advice. Always consult with a healthcare professional regarding your diet and alcohol consumption, especially if you have a family history of addiction or specific medical conditions.*"
      },
      "style": {
        "stroke": "#06b6d4"
      },
      "source": "node_1766256023773",
      "target": "node_1766324188323",
      "animated": true
    }
  ]
}